def add_list (dic_noun, dic_declinable):
    dic = dic_noun | dic_declinable
    #名詞
    add_list = [{'レモン': 0}, {'ラーメン': 0}, {'息子': 0}, {'はず': 0}, {'値段': 0}, {'ウーロン茶': 0}, {'料': 0}, {'の': 0}, {'口当たり': 0},
                {'夏': 0}, {'組み合わせ': 0}, {'シリーズ': 0}, {'ー': 0}, {'ジュース': 0}, {'よう': 0}, {'他社': 0}, {'ビール': 0}, {'DNA': 0},
                {'さ': 0}, {'原点': 0}, {'梅酒': 0}, {'一': 0}, {'択': 0}, {'オッサン': 0}, {'セット': 0}, {'サントリー': 0}, {'生ビール': 0},
                {'外れ': 'reverse'}, {'メーカー': 0}, {'常夏': 0}, {'カクテル': 0}, {'琥珀': 0}, {'液体': 0}, {'濃厚': 1}, {'黒': 0}, {'麹': 0},
                {'芋': 0}, {'万': 0}, {'人受け': 1}, {'ウイスキー': 0}, {'昔': 0}, {'コンビニ': 0}, {'サイズ': 0}, {'酒': 0}, {'大体': 0},
                {'とき': 0}, {'ロック': 0}, {'麦': 0}, {'程': 0}, {'本': 0}, {'焼酎': 0}, {'ウィスキー': 0}, {'円': 0}, {'弱': 0},
                {'的': 0}, {'星': 0}, {'手土産': 0}, {'贈り物': 0}, {'しゃぶしゃぶ': 0}, {'フルーティー': 1}, {'"': 0}, {'さん': 0}, {'是非': 0},
                {'たい': 0}, {'甲乙': 0}, {'ラム': 0}, {'日本': 0}, {'お菓子': 0}, {'スーパードライ': 0}, {'ところ': 0}, {'感': 0}, {'容量': 0},
                {'チョイ': 0}, {'ジャスト': 0}, {'書斎': 0}, {'デスク': 0}, {'初めて': 0}, {'方': 0}, {'体': 0}, {'ノンアルビール': 0},
                {'フローラル': 0}, {'パイン': 0}, {'ココナツ': 0}, {'こと': 0}, {'ハイボール': 0}, {'限定': 0}, {'最大': 0}, {'純': 0},
                {'市場': 0}, {'ゼロ': 0}, {'喉': 0}, {'結局': 0}, {'普段': 0}, {'十': 0}, {'果物': 0}, {'以外': 0}, {'チューハイ': 0},
                {'クラフト': 0}, {'カフェイン': 0}, {'♪': 0}, {'ドリンク': 0}, {'炭酸': 0}, {'水': 0}, {'カテゴリ': 0}, {'日': 0}]
    #接続詞
    add_list += [{'ただし': 0}, {'かつ': 0}]
    #感動詞
    add_list += [{'いや': 'reset'}, {'いやいや': 'reset'}, {'いいえ':'reset'}, {'いえ': 'reset'}]
    #副詞
    add_list += [{'少し': 1.2}, {'とても': 1.5}, {'非常に': 2.0}, {'大変': 2.0}, {'かなり': 1.8}, {'全く': 1.5}, {'全然': 1.5}, {'すごい': 1.5},
                 {'どんどん': 0}, {'それほど': 1.2}, {'本当に': 1.5}, {'スイスイ': 0}, {'丁度': 0}, {'これから': 0}, {'クソ': 2.0}, {'やはり': 0},
                 {'ちょっと': 0}, {'あまり': 0}, {'やや': 0}]
    #連体詞
    add_list += [{'そんな': 0}, {'ちょっとした': 0}]
    #代名詞
    add_list += [{'私': 0}, {'僕': 0}, {'あなた': 0}, {'君': 0}, {'彼': 0}, {'彼女': 0}, {'どなた': 0}, {'誰': 0}, {'これ': 0}, {'ここ': 0},
                 {'こちら': 0}, {'それ': 0}, {'そこ': 0}, {'そちら': 0}, {'あれ': 0}, {'あそこ': 0}, {'あちら': 0}, {'どれ': 0},
                 {'どこ': 0}, {'どちら': 0}, {'この': 0}, {'その': 0}, {'コレ': 0}]
    #動詞
    add_list += [{'なる': 0}, {'する': 0}, {'ある': 0}, {'知れる': 'conjecture'}, {'入る': 0}, {'てる': 0}, {'やる': 0}, {'れる': 0}, {'抜きん出る': 1},
                 {'いる': 0}, {'愛す': 1}, {'飲める': 0}, {'搾る': 0}, {'変わる': 0}, {'わきまえる': 0}, {'慣れ親しむ': 1}, {'飲む': 0}, {'比べる': 0},
                 {'変わる': -1}, {'待つ': 0}, {'見かける': 0}, {'くる': 0}, {'戴く': 0}, {'割る': 0}, {'呑む': 0}, {'いう': 0}, {'思う': 0}, {'纏まる': 0}, {'解る': 1},
                 {'つける': 0}, {'違う': 0}, {'絞る': 0}, {'感じる': 0}, {'見る': 0}, {'残る': 0}, {'強める': 'polarity'}]
    #形容詞
    add_list += [{'まずい': -1}, {'良い': 1}, {'美味しい': 1}, {'高い': 'polarity'}, {'低い': 'polarity'}, {'大きい': 'polarity'}, {'小さい': 'polarity'}, {'重い': 'polarity'},
                 {'軽い': 'polarity'}, {'強い': 'polarity'}, {'弱い': 'polarity'}, {'多い': 'polarity'}, {'少ない': 'polarity'}, {'軽い': 'polarity'},
                 {'激しい': 'polarity'}, {'深い': 'polarity'}, {'浅い': 'polarity'}, {'長い': 'polarity'}, {'短い': 'polarity'}, {'安い': 'polarity'},
                 {'濃い': 'polarity'}, {'薄い': -1}, {'っぽい': 0}, {'新しい': 1}, {'やすい': 1}, {'よい': 1}, {'難しい': 0}, {'がたい': 0}, {'たまらない': 1},
                 {'優しい': 1}, {'広い': 1}, {'香ばしい': 1}]
    #助詞
    add_list += [{'が': 0}, {'は': 0}, {'かも': 0}, {'に': 0}, {'も': 0}, {'だ': 0}, {'より': 0}, {'て': 0}, {'から': 0},
                 {'で': 0}, {'を': 0}, {'と': 0}, {'という': 0}, {'など': 0}, {'ね': 0}, {'のに': 0}, {'か': 0}, {'な': 0},
                 {'だけ': 0}, {'まで': 0}]
    #助動詞
    add_list += [{'ない': 'reverse'}, {'ず': 'reverse'}, {'ぬ': 'reverse'}, {'ん': 'reverse'}, {'ます': 0}, {'です': 0}, {'た': 0}, {'う': 0}, {'戻る': 0}, {'べし': 0}, {'つ': 0}, {'らしい': 0}]
    for x in add_list:
        dic |= x
    return (dic)